{
  "en": {
    "welcome": "Welcome to Sister Botina 2.0! I'm here to help South African parents with information and reminders about your child's immunizations. Please choose your preferred language by typing the corresponding number:\n1. English\n2. Afrikaans\n3. isiZulu\n4. Xhosa",
    "main_menu": "How can Sister Botina 2.0 help you today? Please choose an option:\n1. Immunization Information\n2. Vaccination Schedule\n3. Emotional Support\n4. Change Language\n5. Contact/Help\n6. Visit our Website for more features!",
    "info_menu": "What information are you looking for?\n1. Vaccine Benefits & Safety\n2. Common Side Effects\n3. Understanding the Vaccine Schedule\n4. Debunking Misinformation\n5. Back to Main Menu",
    "info_benefits_safety": "Vaccines are safe and effective tools to protect your child from serious diseases. They work by teaching your body to fight off infections. Scientific studies consistently show their benefits far outweigh any risks. If you have concerns about ingredients, please know that they are present in very small, safe amounts, often less than what you encounter daily in food and water. For more details, consult a healthcare professional.",
    "info_side_effects": "Most vaccine side effects are mild and temporary, like soreness, redness, or a low-grade fever at the injection site. Serious reactions are extremely rare. These mild reactions show your child's immune system is building protection. If you are worried, please consult your clinic or doctor.",
    "info_schedule_explanation": "The South African childhood immunization schedule is carefully designed to protect your child at the right time. Vaccines are given at specific ages to ensure maximum effectiveness against common childhood diseases. For example, at birth, your baby receives BCG and OPV. At 6 weeks, they get OPV, RV, DTaP-IPV-Hib-HepB, and PCV. Sister Botina 2.0 can help you track your child's specific schedule.",
    "info_misinformation": "There's a lot of false information about vaccines. Here are some common myths debunked:\n- MYTH: Vaccines cause autism. FACT: Extensive scientific research has found no link between vaccines and autism.\n- MYTH: Vaccines contain harmful toxins. FACT: Vaccine ingredients are safe in the tiny amounts used and are quickly processed by the body.\n- MYTH: Natural immunity is better. FACT: While natural immunity exists, getting sick with a disease carries far greater risks (e.g., severe illness, disability, death) than vaccination.\nAlways rely on trusted sources like the Department of Health or your healthcare provider for vaccine information.",
    "schedule_prompt_birthdate": "To help Sister Botina 2.0 with your child's vaccination schedule, please provide their birth date in the format YYYY-MM-DD (e.g., 2024-01-15).",
    "schedule_confirm_birthdate": "Thank you! Your child's birth date is set to %BIRTHDATE%. Sister Botina 2.0 will now provide reminders based on the South African immunization schedule. Remember to bring your Road-to-Health book to all appointments.",
    "schedule_upcoming_reminders": "Here is your child's full immunization schedule:",
    "schedule_no_birthdate": "Sister Botina 2.0 doesn't have your child's birth date yet. Please provide it in YYYY-MM-DD format to get reminders and a personalized schedule.",
    "schedule_no_upcoming_reminders": "There are no upcoming vaccination reminders found based on your child's age. Please check their full schedule below.",
    "emotional_support_intro": "It's normal to feel worried or have questions about your child's health and vaccinations. Sister Botina 2.0 is a safe space. What's on your mind? You can ask anything, no judgment. Common concerns include vaccine side effects, fear of 'immune overload,' or guilt over missed appointments.",
    "emotional_support_side_effects": "It's understandable to be concerned about side effects. Remember, most are mild and temporary. Sister Botina 2.0 is here to support you. What specific side effects are you worried about?",
    "emotional_support_immune_overload": "The idea of 'immune overload' from vaccines is a common concern, but it's not supported by science. Babies are exposed to countless germs daily, and vaccines present a tiny fraction of the immune challenge compared to natural infections. Your baby's immune system is incredibly robust!",
    "emotional_support_missed_appointment": "It's okay if you've missed an appointment. Life happens! The most important thing is to get back on track. Please contact your clinic as soon as possible to reschedule. They will help you catch up without judgment. Remember to bring your Road-to-Health book.",
    "emotional_support_general": "Don't worry, you're a great parent and it's brave to ask for help. Thank you for sharing your concerns. If you want to connect with other parents and share your feelings, we have a community forum on our website: https://sister-botina-companion-app-744.created.app/\n\nIs there anything else you'd like to discuss or would you like to go back to the main menu?",
    "language_changed": "Language changed to English.",
    "invalid_input": "I didn't understand that. Please choose a number from the menu options, or type 'menu' to return to the main menu.",
    "goodbye": "Thank you for using Sister Botina 2.0. Have a wonderful day!",
    "reminder_message": "REMINDER from Sister Botina 2.0: Your child has a vaccination due on %VACCINE_DATE% for %VACCINE_NAME%. Please remember to bring your Road-to-Health book to the clinic. If you have questions, reply '1' for info or '3' for emotional support.",
    "contact_help": "🏥 **Emergency Services**\n\n**For life-threatening emergencies**\n📞 Call 10177\n\n**ER24 Emergency Medical Services**\n📞 Call 084 124\n\n**Netcare 911**\n📞 Call 082 911\n\n☎️ **National Health Line**\nFree health information and advice\n📞 Call 0800 029 999\n\n---\nType 'menu' to return to the main options.",
    "gemini_intro": "Hello! I am Sister Botina 2.0's conversational engine. How can I help you today? You can ask me anything about child health, immunizations, or just for some emotional support. Please note that I am an AI, and my responses are for informational purposes only, not a substitute for professional medical advice. Type 'menu' to go back to the main menu.",
    "website_link_message": "You can access more features, including a clinic locator and community forum, on our website: https://sister-botina-companion-app-744.created.app/",
    "data_privacy_disclaimer": "🔒 **Data Privacy & Security**\n\nYour privacy is our priority. Any personal information you share, like your child's date of birth, is used only to provide you with personalized reminders. All data is handled with encryption and is compliant with the Protection of Personal Information Act (POPIA)."
  },
  "af": {
    "welcome": "Welkom by Suster Botina 2.0! Ek is hier om Suid-Afrikaanse ouers te help met inligting en aanmanings oor jou kind se inentings. Kies asseblief jou voorkeurtaal deur die ooreenstemmende nommer te tik:\n1. English\n2. Afrikaans\n3. isiZulu\n4. Xhosa",
    "main_menu": "Hoe kan Suster Botina 2.0 jou vandag help? Kies asseblief 'n opsie:\n1. Immuniseringsinligting\n2. Inentingskedule\n3. Emosionele Ondersteuning\n4. Verander Taal\n5. Kontak/Hulp\n6. Besoek ons ​​webwerf vir meer funksies!",
    "info_menu": "Watter inligting soek jy?\n1. Voordele en Veiligheid van Entstowwe\n2. Algemene Newe-effekte\n3. Verstaan die Inentingskedule\n4. Ontmasker Misinformasie\n5. Terug na Hoofkieslys",
    "info_benefits_safety": "Entstowwe is veilige en effektiewe hulpmiddels om jou kind teen ernstige siektes te beskerm. Hulle werk deur jou liggaam te leer om infeksies te beveg. Wetenskaplike studies toon konsekwent dat hul voordele enige risiko's ver oorskry. As jy bekommerd is oor bestanddele, weet asseblief dat dit in baie klein, veilige hoeveelhede voorkom, dikwels minder as wat jy daagliks in kos en water teëkom. Raadpleeg 'n gesondheidswerker vir meer besonderhede.",
    "info_side_effects": "Die meeste newe-effekte van entstowwe is lig en tydelik, soos seerheid, rooiheid of 'n ligte koors op die inspuitplek. Ernstige reaksies is uiters skaars. Hierdie ligte reaksies toon dat jou kind se immuunstelsel beskerming opbou. As jy bekommerd is, raadpleeg asseblief jou kliniek of dokter.",
    "info_schedule_explanation": "Die Suid-Afrikaanse kinderimmuniseringskedule is sorgvuldig ontwerp om jou kind op die regte tyd te beskerm. Entstowwe word op spesifieke ouderdomme gegee om maksimum doeltreffendheid teen algemene kindersiektes te verseker. By geboorte ontvang jou baba byvoorbeeld BCG en OPV. Op 6 weke kry hulle OPV, RV, DTaP-IPV-Hib-HepB en PCV. Suster Botina 2.0 kan jou help om jou kind se spesifieke skedule te volg.",
    "info_misinformation": "Daar is baie vals inligting oor entstowwe. Hier is 'n paar algemene mites ontmasker:\n- MITE: Entstowwe veroorsaak outisme. FEIT: Uitgebreide wetenskaplike navorsing het geen verband tussen entstowwe en outisme gevind nie.\n- MITE: Entstowwe bevat skadelike gifstowwe. FEIT: Entstofbestanddele is veilig in die klein hoeveelhede wat gebruik word en word vinnig deur die liggaam verwerk.\n- MITE: Natuurlike immuniteit is beter. FEIT: Alhoewel natuurlike immuniteit bestaan, hou siekte met 'n siekte veel groter risiko's in (bv. ernstige siekte, gestremdheid, dood) as inenting.\nVertrou altyd op betroubare bronne soos die Departement van Gesondheid of jou gesondheidsorgverskaffer vir entstofinligting.",
    "schedule_prompt_birthdate": "Om Suster Botina 2.0 met jou kind se inentingskedule te help, verskaf asseblief hul geboortedatum in die formaat JJJJ-MM-DD (bv. 2024-01-15).",
    "schedule_confirm_birthdate": "Dankie! Jou kind se geboortedatum is gestel op %BIRTHDATE%. Suster Botina 2.0 sal nou aanmanings verskaf gebaseer op die Suid-Afrikaanse immuniseringskedule. Onthou om jou Pad-na-Gesondheid boek na alle afsprake te bring.",
    "schedule_upcoming_reminders": "Hier is jou kind se volledige immuniseringskedule:",
    "schedule_no_birthdate": "Suster Botina 2.0 het nog nie jou kind se geboortedatum nie. Verskaf dit asseblief in JJJJ-MM-DD formaat om aanmanings en 'n persoonlike skedule te kry.",
    "schedule_no_upcoming_reminders": "Geen opkomende inentingsaanmanings gevind gebaseer op jou kind se ouderdom nie. Kontroleer asseblief hul volledige skedule hieronder.",
    "emotional_support_intro": "Dit is normaal om bekommerd te voel of vrae te hê oor jou kind se gesondheid en inentings. Suster Botina 2.0 is 'n veilige ruimte. Wat is op jou hart? Jy kan enigiets vra, sonder oordeel. Algemene bekommernisse sluit in entstof newe-effekte, vrees vir 'immuunoorlading' of skuldgevoelens oor gemiste afsprake.",
    "emotional_support_side_effects": "Dit is verstaanbaar om bekommerd te wees oor newe-effekte. Onthou, die meeste is lig en tydelik. Suster Botina 2.0 is hier om jou te ondersteun. Watter spesifieke newe-effekte bekommer jou?",
    "emotional_support_immune_overload": "Die idee van 'immuunoorlading' van entstowwe is 'n algemene bekommernis, maar dit word nie deur die wetenskap ondersteun nie. Babas word daagliks aan ontelbare kieme blootgestel, en entstowwe bied 'n klein fraksie van die immuunuitdaging in vergelyking met natuurlike infeksies. Jou baba se immuunstelsel is ongelooflik robuust!",
    "emotional_support_missed_appointment": "Dit is goed as jy 'n afspraak gemis het. Die lewe gebeur! Die belangrikste ding is om weer op koers te kom. Kontak asseblief jou kliniek so gou as moontlik om 'n nuwe afspraak te maak. Hulle sal jou help om in te haal sonder oordeel. Onthou om jou Pad-na-Gesondheid boek te bring.",
    "emotional_support_general": "Moenie bekommerd wees nie, jy is 'n wonderlike ouer en dit is dapper om hulp te vra. Dankie dat jy jou bekommernisse gedeel het. As jy met ander ouers wil skakel en jou gevoelens wil deel, het ons 'n gemeenskapsforum op ons webwerf: https://sister-botina-companion-app-744.created.app/\n\nIs daar enigiets anders wat jy wil bespreek of wil jy teruggaan na die hoofkieslys?",
    "language_changed": "Taal verander na Afrikaans.",
    "invalid_input": "Ek het dit nie verstaan nie. Kies asseblief 'n nommer uit die kieslysopsies, of tik 'menu' om terug te keer na die hoofkieslys.",
    "goodbye": "Dankie dat jy Suster Botina 2.0 gebruik het. Lekker dag!",
    "reminder_message": "HERINNERING van Suster Botina 2.0: Jou kind het 'n inenting wat op %VACCINE_DATE% vir %VACCINE_NAME% verskuldig is. Onthou asseblief om jou Pad-na-Gesondheid boek na die kliniek te bring. As jy vrae het, antwoord '1' vir inligting of '3' vir emosionele ondersteuning.",
    "contact_help": "🏥 **Nooddienste**\n\n**Vir lewensgevaarlike noodgevalle**\n📞 Bel 10177\n\n**ER24 Nood mediese dienste**\n📞 Bel 084 124\n\n**Netcare 911**\n📞 Bel 082 911\n\n☎️ **Nasionale Gesondheidslyn**\nGratis gesondheidsinligting en advies\n📞 Bel 0800 029 999\n\n---\nTik 'menu' om terug te keer na die hoofopsies.",
    "gemini_intro": "Hallo! Ek is Suster Botina 2.0 se gespreksmotor. Hoe kan ek jou vandag help? Jy kan my enigiets vra oor kindergesondheid, immunisering, of net vir emosionele ondersteuning. Let asseblief daarop dat ek 'n KI is, en my antwoorde is slegs vir inligting, nie 'n plaasvervanger vir professionele mediese advies nie. Tik 'menu' om terug te gaan na die hoofkieslys.",
    "website_link_message": "Jy kan meer funksies kry, insluitend 'n kliniekopspoorder en gemeenskapsforum, op ons webwerf: https://sister-botina-companion-app-744.created.app/",
    "data_privacy_disclaimer": "🔒 **Data Privacy & Security**\n\nYour privacy is our priority. Any personal information you share, like your child's date of birth, is used only to provide you with personalized reminders. All data is handled with encryption and is compliant with the Protection of Personal Information Act (POPIA)."
  },
  "zu": {
    "welcome": "Siyakwamukela ku-Sister Botina 2.0! Ngilapha ukuze ngisize abazali baseNingizimu Afrika ngolwazi nezikhumbuzi mayelana nokugoma kwengane yakho. Sicela ukhethe ulimi olukhethayo ngokuthayipha inombolo ehambisanayo:\n1. English\n2. Afrikaans\n3. isiZulu\n4. Xhosa",
    "main_menu": "USister Botina 2.0 angakusiza kanjani namuhla? Sicela ukhethe inketho:\n1. Ulwazi Lokugoma\n2. Isheduli Yokugoma Nezikhumbuzi\n3. Ukwesekwa Ngokomzwelo\n4. Shintsha Ulimi\n5. Xhumana/Usizo\n6. Vakashela iWebusayithi yethu ukuze uthole ezinye izici!",
    "info_menu": "Loluphi ulwazi olufunayo?\n1. Izinzuzo Nokuphepha Kwemigomo\n2. Imiphumela Emibi Ejwayelekile\n3. Ukuqonda Isheduli Yokugoma\n4. Ukulwa Nokungaqondi Kahle\n5. Buyela Ku-Main Menu",
    "info_benefits_safety": "Imigomo iphephile futhi iyasebenza ukuvikela ingane yakho ezifweni ezinzima. Isebenza ngokufundisa umzimba wakho ukulwa nezifo. Ucwaningo lwesayensi lubonisa ngokuqhubekayo ukuthi izinzuzo zayo zidlula kakhulu noma yiziphi izingozi. Uma unokukhathazeka mayelana nezithako, sicela wazi ukuthi zikhona ngamanani amancane kakhulu, aphephile, ngokuvamile ngaphansi kwalokho okuhlangana nakho nsuku zonke ekudleni nasemanzini. Ukuze uthole imininingwane eyengeziwe, thintana nochwepheshe bezempilo.",
    "info_side_effects": "Imiphumela emibi eminingi yemigomo ilula futhi yesikhashana, njengobuhlungu, ububomvu, noma umkhuhlane omncane endaweni yomjovo. Ukusabela okubi kakhulu kuyivelakancane. Lokhu kusabela okulula kubonisa ukuthi amasosha omzimba wengane yakho akha ukuvikela. Uma ukhathazekile, sicela uthintane nomtholampilo wakho noma udokotela.",
    "info_schedule_explanation": "Isheduli yokugoma yezingane yaseNingizimu Afrika yakhelwe ngokucophelela ukuvikela ingane yakho ngesikhathi esifanele. Imigomo inikezwa ngeminyaka ethile ukuze kuqinisekiswe ukusebenza okuphezulu ezifweni ezivamile zezingane. Ngokwesibonelo, lapho izalwa, ingane yakho ithola i-BCG ne-OPV. Ngemva kwamaviki angu-6, ithola i-OPV, i-RV, i-DTaP-IPV-Hib-HepB, ne-PCV. USister Botina 2.0 angakusiza ukuthi ulandele isheduli ethile yengane yakho.",
    "info_misinformation": "Kunolwazi oluningi olungelona iqiniso mayelana nemigomo. Nazi ezinye izinganekwane ezivamile ezichithwe:\n- INGANEKWANE: Imigomo ibangela i-autism. IQINISO: Ucwaningo olunzulu lwesayensi alutholanga ukuxhumana phakathi kwemigomo ne-autism.\n- INGANEKWANE: Imigomo iqukethe ubuthi obuyingozi. IQINISO: Izithako zemigomo ziphephile ngamanani amancane asetshenzisiwe futhi zicutshungulwa ngokushesha umzimba.\n- INGANEKWANE: Amasosha omzimba emvelo angcono. IQINISO: Nakuba amasosha omzimba emvelo ekhona, ukugula ngesifo kunezinkinga ezinkulu kakhulu (isb., ukugula okukhulu, ukukhubazeka, ukufa) kunokugoma.\nNgaso sonke isikhathi thembela emithonjeni ethembekile efana noMnyango Wezempilo noma umhlinzeki wakho wezempilo ukuze uthole ulwazi lokugoma.",
    "schedule_prompt_birthdate": "Ukuze usize uSister Botina 2.0 ngesheduli yokugoma yengane yakho, sicela unikeze usuku lwayo lokuzalwa ngesimo esithi YYYY-MM-DD (isb., 2024-01-15).",
    "schedule_confirm_birthdate": "Ngiyabonga! Usuku lokuzalwa lwengane yakho selubekwe ku-%BIRTHDATE%. Manje uSister Botina 2.0 uzokunikeza izikhumbuzi ezisekelwe eshedulini yokugoma yaseNingizimu Afrika. Sicela ukhumbule ukuletha incwadi yakho ye-Road-to-Health kuzo zonke izikhathi zokubonana.",
    "schedule_upcoming_reminders": "Nazi isheduli yokugoma ephelele yengane yakho:",
    "schedule_no_birthdate": "USister Botina 2.0 akanalo usuku lokuzalwa lwengane yakho okwamanje. Sicela ulunikeze ngesimo esithi YYYY-MM-DD ukuze uthole izikhumbuzi nesheduli eyenziwe ngendlela efanele.",
    "schedule_no_upcoming_reminders": "Azikho izikhumbuzi zokugoma ezizayo ezitholakale ngokusekelwe eminyakeni yengane yakho. Sicela uhlole isheduli yayo ephelele ngezansi.",
    "emotional_support_intro": "Kuvamile ukuzizwa ukhathazekile noma ube nemibuzo mayelana nempilo yengane yakho nokugoma. USister Botina 2.0 uyindawo ephephile. Yini ekukhathazayo? Ungabuza noma yini, ngaphandle kokwahlulela. Ukukhathazeka okuvamile kufaka phakathi imiphumela emibi yemigomo, ukwesaba 'ukugcwala kwamasosha omzimba,' noma ukuzizwa unecala ngokungahambeli izikhathi zokubonana.",
    "emotional_support_side_effects": "Kuyaqondakala ukukhathazeka ngemiphumela emibi. Khumbula, iningi lilula futhi liyesikhashana. USister Botina 2.0 ulapha ukuze akusekele. Yimiphi imiphumela emibi ethile ekukhathazayo?",
    "emotional_support_immune_overload": "Umqondo 'wokugcwala kwamasosha omzimba' kusuka emigomeni uwukukhathazeka okuvamile, kodwa awusekelwe isayensi. Izinsana zivezwe kumagciwane amaningi nsuku zonke, futhi imigomo inikeza ingxenye encane kakhulu yenselele yamasosha omzimba uma kuqhathaniswa nezifo zemvelo. Amasosha omzimba wengane yakho aqine kakhulu!",
    "emotional_support_missed_appointment": "Kulungile uma uphuthelwe isikhathi sokubonana. Impilo iyenzeka! Okubaluleke kakhulu ukubuyela endleleni efanele. Sicela uthintane nomtholampilo wakho ngokushesha okungenzeka ukuze uhlele kabusha. Bazokusiza ukuthi ubambe iqhaza ngaphandle kokwahlulela. Sicela ulethe incwadi yakho ye-Road-to-Health.",
    "emotional_support_general": "Ungakhathazeki, ungomunye wabazali abahle futhi kuyisibindi ukucela usizo. Ngiyabonga ngokwabelana ngezinkinga zakho. Uma ufuna ukuxhumana nabanye abazali futhi wabelane ngemizwa yakho, sinesigungu somphakathi kuwebusayithi yethu: https://sister-botina-companion-app-744.created.app/\n\nIngabe kukhona okunye ongathanda ukukuxoxa noma ungathanda ukubuyela kumenyu enkulu?",
    "language_changed": "Ulimi lushintshele ku-isiZulu.",
    "invalid_input": "Angikuzwanga lokho. Sicela ukhethe inombolo kusuka ezinkethweni zemenyu, noma thayipha 'menu' ukuze ubuyele kumenyu enkulu.",
    "goodbye": "Ngiyabonga ngokusebenzisa uSister Botina 2.0. Ube nosuku oluhle!",
    "reminder_message": "ISIKHUMBUZI esivela ku-Sister Botina 2.0: Ingane yakho inokugoma okufanele ngo-%VACCINE_DATE% kwe-%VACCINE_NAME%. Sicela ukhumbule ukuletha incwadi yakho ye-Road-to-Health emtholampilo. Uma unemibuzo, phendula '1' ukuze uthole ulwazi noma '3' ukuze uthole ukwesekwa ngokomzwelo.",
    "contact_help": "🏥 **Amasevisi Ezimo Eziphuthumayo**\n\n**Ngezimo eziphuthumayo eziyingozi empilweni**\n📞 Shayela ku-10177\n\n**ER24 Amasevisi ezimo eziphuthumayo ezempilo**\n📞 Shayela ku-084 124\n\n**Netcare 911**\n📞 Shayela ku-082 911\n\n☎️ **Ulayini Kazwelonke Wezempilo**\nUlwazi lwezempilo lwamahhala neseluleko\n📞 Shayela ku-0800 029 999\n\n---\nThayipha 'menu' ukuze ubuyele kumenyu enkulu.",
    "gemini_intro": "Sawubona! Ngingumshini wezingxoxo ka-Sister Botina 2.0. Ngingakusiza kanjani namuhla? Ungangibuza noma yini mayelana nempilo yengane, ukugoma, noma nje ukwesekwa ngokomzwelo. Ngicela uqaphele ukuthi ngiyi-AI, futhi izimpendulo zami zingezolwazi kuphela, azithathi isikhundla seseluleko sochwepheshe bezokwelapha. Thayipha 'menu' ukuze ubuyele kumenyu enkulu.",
    "website_link_message": "Ungathola ezinye izici, okuhlanganisa ithuluzi lokuthola umtholampilo kanye nenkundla yomphakathi, kuwebusayithi yethu: https://sister-botina-companion-app-744.created.app/",
    "data_privacy_disclaimer": "🔒 **Data Privacy & Security**\n\nYour privacy is our priority. Any personal information you share, like your child's date of birth, is used only to provide you with personalized reminders. All data is handled with encryption and is compliant with the Protection of Personal Information Act (POPIA)."
  },
  "xh": {
    "welcome": "Wamkelekile ku-Sister Botina 2.0! Ndilapha ukuze ndincede abazali baseMzantsi Afrika ngolwazi kunye nezikhumbuzo malunga nokugonywa komntwana wakho. Nceda ukhethe ulwimi oluthandayo ngokuchwetheza inombolo ehambelanayo:\n1. English\n2. Afrikaans\n3. isiZulu\n4. Xhosa",
    "main_menu": "USister Botina 2.0 angakunceda njani namhlanje? Nceda ukhethe ukhetho:\n1. Ulwazi Lokugonya\n2. Ishedyuli Yokugonya Nezikhumbuzo\n3. Inkxaso Yeemvakalelo\n4. Guqula Ulwimi\n5. Qhagamshelana/Nceda\n6. Ndwendwela iwebhusayithi yethu ukuze ufumane ezinye izixhobo!",
    "info_menu": "Loluphi ulwazi olufunayo?\n1. Iinzuzo Nokukhuseleka Kwezithinteli\n2. Iziphumo Ebezingalindelekanga Eziqhelekileyo\n3. Ukuqonda Ishedyuli Yokugonya\n4. Ukuchitha Ulwazi Olungachananga\n5. Buyela Kwi-Main Menu",
    "info_benefits_safety": "Izithinteli zikhuselekile kwaye ziyasebenza ukukhusela umntwana wakho kwizifo ezinzima. Zisebenza ngokufundisa umzimba wakho ukulwa nezifo. Izifundo zesayensi zibonisa ngokuqhubekayo ukuba iinzuzo zazo zidlula kakhulu naziphi na iingozi. Ukuba unenkxalabo malunga nezithako, nceda wazi ukuba zikhona ngamanani amancinci kakhulu, akhuselekileyo, ahlala engaphantsi kunokuba uhlangana nako yonke imihla ekutyeni nasemanzini. Ukufumana iinkcukacha ezithe vetshe, thetha nogqirha wezempilo.",
    "info_side_effects": "Uninzi lweziphumo ebezingalindelekanga zezithinteli zilula kwaye zezexeshana, njengobuhlungu, ububomvu, okanye umkhuhlane omncinci kwindawo yokutofa. Ukusabela okubi kakhulu kunqabile kakhulu. Olu lusabela oluncinci lubonisa ukuba inkqubo yomzimba womntwana wakho yakha ukhuseleko. Ukuba unexhala, nceda thetha nekliniki yakho okanye ugqirha.",
    "info_schedule_explanation": "Ishedyuli yokugonya yabantwana baseMzantsi Afrika yenzelwe ngononophelo ukukhusela umntwana wakho ngexesha elifanelekileyo. Izithinteli zinikwa ngeminyaka ethile ukuqinisekisa ukusebenza okuphezulu ngokuchasene nezifo eziqhelekileyo zabantwana. Ngokomzekelo, ekuzalweni, umntwana wakho ufumana i-BCG ne-OPV. Kwiiveki ezi-6, bafumana i-OPV, i-RV, i-DTaP-IPV-Hib-HepB, kunye ne-PCV. USister Botina 2.0 angakunceda ukuba ulandele ishedyuli ethile yomntwana wakho.",
    "info_misinformation": "Kunolwazi olungachananga oluninzi malunga nezithinteli. Nazi ezinye iintsomi eziqhelekileyo ezichithiweyo:\n- INTSOMI: Izithinteli zibangela i-autism. INYANISO: Uphando olunzulu lwesayensi alufumananga nxulumano phakathi kwezithinteli ne-autism.\n- INTSOMI: Izithinteli zineetyhefu eziyingozi. INYANISO: Izithako zezithinteli zikhuselekile ngamanani amancinci asetyenzisiweyo kwaye zicutshulwa ngokukhawuleza ngumzimba.\n- INTSOMI: Ukukhuseleka komzimba wendalo kungcono. INYANISO: Ngelixa ukukhuseleka komzimba wendalo kukho, ukugula ngesifo kuneengozi ezinkulu kakhulu (umz., isifo esinzima, ukukhubazeka, ukufa) kunokugonya.\nSoloko uthembele kwimithombo ethembekileyo efana neSebe Lezempilo okanye umboneleli wakho wezempilo ngolwazi lokugonya.",
    "schedule_prompt_birthdate": "Ukuze uncede uSister Botina 2.0 ngeshedyuli yokugonya yomntwana wakho, nceda unikeze umhla wokuzalwa kwabo ngendlela ethi YYYY-MM-DD (umz., 2024-01-15).",
    "schedule_confirm_birthdate": "Enkosi! Umhla wokuzalwa komntwana wakho umiselwe ku-%BIRTHDATE%. Ngoku uSister Botina 2.0 uza kukunika izikhumbuzo ezisekelwe kwishedyuli yokugonya yaseMzantsi Afrika. Nceda ukhumbule ukuzisa incwadi yakho ye-Road-to-Health kuzo zonke iintlanganiso.",
    "schedule_upcoming_reminders": "Nazi ishedyuli yokugonya epheleleyo yomntwana wakho:",
    "schedule_no_birthdate": "USister Botina 2.0 akakabi nawo umhla wokuzalwa komntwana wakho okwangoku. Nceda uwunikeze ngendlela ethi YYYY-MM-DD ukuze ufumane izikhumbuzo kunye neshedyuli yomntu siqu.",
    "schedule_no_upcoming_reminders": "Akukho zikhumbuzo zokugonya ezizayo ezifunyenweyo ngokusekelwe kwiminyaka yomntwana wakho. Nceda ujonge ishedyuli yabo epheleleyo ngezantsi.",
    "emotional_support_intro": "Kuqhelekile ukuziva ukhathazekile okanye ube nemibuzo malunga nempilo yomntwana wakho kunye nokugonya. USister Botina 2.0 yindawo ekhuselekileyo. Yintoni ekukhathazayo? Ungabuza nantoni na, ngaphandle kokugweba. Inkxalabo eqhelekileyo ibandakanya iziphumo ebezingalindeleka zezithinteli, uloyiko 'lokugcwala komzimba,' okanye ityala malunga nokungahambeli iintlanganiso.",
    "emotional_support_side_effects": "Kuyaqondakala ukuba unexhala malunga neziphumo ebezingalindeleka. Khumbula, uninzi zilula kwaye zezexeshana. USister Botina 2.0 ulapha ukuze akuxhase. Zeziphi iziphumo ebezingalindeleka ezithile ezikukhathazayo?",
    "emotional_support_immune_overload": "Ingcamango 'yokugcwala komzimba' kwizithinteli yinkxalabo eqhelekileyo, kodwa ayixhaswa yisayensi. Iintsana zivezwe kwiintsholongwane ezingenakubalwa yonke imihla, kwaye izithinteli zibonisa inxalenye encinci kakhulu yomceli mngeni wokukhusela umzimba xa kuthelekiswa nezifo zendalo. Inkqubo yomzimba womntwana wakho yomelele kakhulu!",
    "emotional_support_missed_appointment": "Kulungile ukuba uphoswe yintlanganiso. Ubomi buyaqhubeka! Okona kubalulekileyo kukubuyela endleleni. Nceda uqhagamshelane nekliniki yakho ngokukhawuleza ukuze uhlele kwakhona. Baza kukunceda ukuba ubambe ngaphandle kokugweba. Nceda zisa incwadi yakho ye-Road-to-Health.",
    "emotional_support_general": "Don't worry, you're a great parent and it's brave to ask for help. Thank you for sharing your concerns. If you want to connect with other parents and share your feelings, we have a community forum on our website: https://sister-botina-companion-app-744.created.app/\n\nIs there anything else you'd like to discuss or would you like to go back to the main menu?",
    "language_changed": "Ulwimi lutshintshele ku-Xhosa.",
    "invalid_input": "Andiyiqondanga loo nto. Nceda ukhethe inombolo kwiinketho zemenyu, okanye chwetheza 'menu' ukuze ubuyele kwimenyu ephambili.",
    "goodbye": "Enkosi ngokusebenzisa uSister Botina 2.0. Ube nosuku oluhle!",
    "reminder_message": "ISIKHUMBUZO esivela ku-Sister Botina 2.0: Umntwana wakho unokugonya okufanele ngo-%VACCINE_DATE% kwe-%VACCINE_NAME%. Nceda ukhumbule ukuzisa incwadi yakho ye-Road-to-Health kwikliniki. Ukuba unayo imibuzo, phendula '1' ngolwazi okanye '3' ngenkxaso yeemvakalelo.",
    "contact_help": "🏥 **Iinkonzo Ezingxamisekileyo**\n\n**Ngezimo eziphuthumayo eziyingozi empilweni**\n📞 Fowunela u-10177\n\n**ER24 Iinkonzo ezingxamisekileyo zonyango**\n📞 Fowunela u-084 124\n\n**Netcare 911**\n📞 Fowunela u-082 911\n\n☎️ **Umnxeba Kazwelonke Wezempilo**\nUlwazi lwezempilo lwasimahla kunye nengcebiso\n📞 Fowunela u-0800 029 999\n\n---\nChwetheza 'menu' ukuze ubuyele kwiinketho eziphambili.",
    "gemini_intro": "Mholweni! Ndingumshini weengxoxo ka-Sister Botina 2.0. Ndingakunceda njani namhlanje? Ungandibuza nantoni na malunga nempilo yomntwana, ukugonya, okanye inkxaso yeemvakalelo. Nceda qaphela ukuba ndiyi-AI, kwaye iimpendulo zam zezolwazi kuphela, ayisiyo enye indawo yengcebiso yezonyango. Chwetheza 'menu' ukuze ubuyele kwimenyu ephambili.",
    "website_link_message": "Esi sixhobo siza kufumaneka kungekudala! Iqonga loluntu liya kuba yindawo ekhuselekileyo, engaziwayo, exhaswa yi-Supabase ukuze abazali babelane ngamava kwaye bafumane inkxaso kubo."
  }
}
